## Exercise 03 : Selects and aggregations

Import libraries

In [1]:
import pandas as pd

* load the JSON file that you created in the previous exercise into a dataframe
    * set CarNumber as the index column

In [2]:
load_file_path = "../data/auto.json"
df = pd.read_json(load_file_path)
df.set_index("CarNumber", inplace=True)
display(df)

              Refund         Fines    Make    Model
CarNumber
Y163O8161RUS       2   3200.000000    Ford    Focus
E432XX77RUS        1   6500.000000  Toyota    Camry
7184TT36RUS        1   2100.000000    Ford    Focus
X582HE161RUS       2   2000.000000    Ford    Focus
92918M178RUS       1   5700.000000    Ford    Focus
...              ...           ...     ...      ...
Y163O8161RUS       2   1600.000000    Ford    Focus
M0309X197RUS       1  22300.000000    Ford    Focus
O673E8197RUS       2    600.000000    Ford    Focus
8610T8154RUS       1   2000.000000    Ford    Focus
H419XE197RUS       2   8594.586466  Toyota  Corolla

[725 rows x 4 columns]

* make the following selects
  * display the rows only where the fines are more than 2,100

In [3]:
filtered_df_1 = df[df["Fines"] > 2100]
display(filtered_df_1)

              Refund         Fines        Make    Model
CarNumber
Y163O8161RUS       2   3200.000000        Ford    Focus
E432XX77RUS        1   6500.000000      Toyota    Camry
92918M178RUS       1   5700.000000        Ford    Focus
H234YH197RUS       2   6000.000000        Ford    Focus
E40577152RUS       1   8594.586466        Ford    Focus
...              ...           ...         ...      ...
O718MM163RUS       2   8594.586466        Ford    Focus
7065C8197RUS       2  11400.000000  Volkswagen   Passat
O22097197RUS       1  24300.000000        Ford    Focus
M0309X197RUS       1  22300.000000        Ford    Focus
H419XE197RUS       2   8594.586466      Toyota  Corolla

[455 rows x 4 columns]

  * display the rows only where the fines are more than 2,100 and the refund
  equals 2

In [4]:
filtered_df_2 = df[(df["Fines"] > 2100) & (df["Refund"] == 2.0)]
display(filtered_df_2)

              Refund         Fines        Make    Model
CarNumber
Y163O8161RUS       2   3200.000000        Ford    Focus
H234YH197RUS       2   6000.000000        Ford    Focus
707987163RUS       2   2200.000000        Ford    Focus
K330T8197RUS       2   8200.000000       Skoda  Octavia
M592CH197RUS       2   8594.586466       Skoda  Octavia
...              ...           ...         ...      ...
O136HO197RUS       2   7800.000000      Toyota  Corolla
O68897197RUS       2  12300.000000        Ford    Focus
O718MM163RUS       2   8594.586466        Ford    Focus
7065C8197RUS       2  11400.000000  Volkswagen   Passat
H419XE197RUS       2   8594.586466      Toyota  Corolla

[309 rows x 4 columns]

  * display the rows only where the models are from the list: `````[’Focus’, ’Corolla’]`````

In [5]:
models_to_filter = ["Focus", "Corolla"]
filtered_df_3 = df[df["Model"].isin(models_to_filter)]
display(filtered_df_3)

              Refund         Fines    Make    Model
CarNumber
Y163O8161RUS       2   3200.000000    Ford    Focus
7184TT36RUS        1   2100.000000    Ford    Focus
X582HE161RUS       2   2000.000000    Ford    Focus
92918M178RUS       1   5700.000000    Ford    Focus
H234YH197RUS       2   6000.000000    Ford    Focus
...              ...           ...     ...      ...
Y163O8161RUS       2   1600.000000    Ford    Focus
M0309X197RUS       1  22300.000000    Ford    Focus
O673E8197RUS       2    600.000000    Ford    Focus
8610T8154RUS       1   2000.000000    Ford    Focus
H419XE197RUS       2   8594.586466  Toyota  Corolla

[593 rows x 4 columns]

  * display the rows only where the car number is from the list:
  ```[’Y7689C197RUS’, ’92928M178RUS’, ’7788KT197RUS’, ’H115YO163RUS’, ’X758HY197RUS’]```

In [6]:
car_numbers_to_filter = [
    "Y7689C197RUS",
    "92928M178RUS",
    "7788KT197RUS",
    "H115YO163RUS",
    "X758HY197RUS",
]
filtered_df_4 = df[df.index.isin(car_numbers_to_filter)]
display(filtered_df_4)

              Refund          Fines  Make  Model
CarNumber
92928M178RUS       1    8594.586466  Ford  Focus
H115YO163RUS       1    2200.000000  Ford  Focus
7788KT197RUS       2   12000.000000  Ford  Focus
X758HY197RUS       2   24200.000000  Ford  Focus
X758HY197RUS       2   72600.000000  Ford  Focus
Y7689C197RUS       1   27000.000000  Ford  Focus
92928M178RUS       1     600.000000  Ford  Focus
H115YO163RUS       1    8594.586466  Ford  Focus
H115YO163RUS       2    1100.000000  Ford  Focus
7788KT197RUS       2    8594.586466  Ford  Focus
7788KT197RUS       1   20000.000000  Ford  Focus
X758HY197RUS       2  145200.000000  Ford  Focus
92928M178RUS       1    1200.000000  Ford  Focus
Y7689C197RUS       2    9000.000000  Ford  Focus
Y7689C197RUS       2   45000.000000  Ford  Focus
7788KT197RUS       2    4000.000000  Ford  Focus
Y7689C197RUS       1   36000.000000  Ford  Focus
92928M178RUS       2    3000.000000  Ford  Focus

* make the aggregations with the make and the model
  * display the median fines grouped by the make

In [7]:
group_by_make = df.groupby("Make")
group_by_make.agg({"Fines": "median"})

             Fines
Make
Audi        4200.0
BMW         6500.0
Ford        3500.0
Skoda       3250.0
Toyota      7700.0
Volkswagen  4300.0
Volvo       8500.0

  * display the median fines grouped by the make and the model

In [8]:
group_by_make_model = df.groupby(["Make", "Model"])
group_by_make_model.agg({"Fines": "median"})

                     Fines
Make       Model
Ford       Focus    3500.0
           Mondeo   7650.0
Skoda      Octavia  3250.0
Toyota     Camry    7700.0
           Corolla  7700.0
Volkswagen Golf     4800.0
           Jetta    2800.0
           Passat   3500.0
           Touareg  5800.0

  * display the number of fines grouped by the make and the model in order to
  understand if we can trust the median values

In [9]:
group_by_make_model.agg({"Fines": "count"})

                    Fines
Make       Model
Ford       Focus      575
           Mondeo       6
Skoda      Octavia     48
Toyota     Camry       16
           Corolla     18
Volkswagen Golf        20
           Jetta        6
           Passat      22
           Touareg      5

  * display the minimum and the maximum fines grouped by the make and the
  model in order to better understand the variance

In [10]:
group_by_make_model.agg({"Fines": "max"})

                            Fines
Make       Model
Ford       Focus    180000.000000
           Mondeo    46200.000000
Skoda      Octavia  145000.000000
Toyota     Camry     22400.000000
           Corolla   34300.000000
Volkswagen Golf     168000.000000
           Jetta     46000.000000
           Passat    29700.000000
           Touareg    8594.586466

In [11]:
group_by_make_model.agg({"Fines": "min"})

                     Fines
Make       Model
Ford       Focus     100.0
           Mondeo   1100.0
Skoda      Octavia   300.0
Toyota     Camry     500.0
           Corolla   900.0
Volkswagen Golf      200.0
           Jetta     500.0
           Passat    100.0
           Touareg   500.0

  * display the standard deviation of the fines grouped by the make and the model
  in order to better understand the variance

In [12]:
group_by_make_model.agg({"Fines": "std"})

                           Fines
Make       Model
Ford       Focus    15041.269437
           Mondeo   18987.329108
Skoda      Octavia  24339.742174
Toyota     Camry     6410.250654
           Corolla   9629.325617
Volkswagen Golf     36950.839950
           Jetta    17743.026799
           Passat    6969.739135
           Touareg   3461.778173

* make the aggregations with the car number
  * display the car numbers grouped by the number of the fines in descending
  order, we want to find those who most often violated the law

In [13]:
group_by_car_number = df.groupby("CarNumber")
fines_count_df = group_by_car_number.agg({"Fines": "count"})
sorted_fines_count = fines_count_df.sort_values(
    by="Fines",
    ascending=False,
)
display(sorted_fines_count)

              Fines
CarNumber
Y7689C197RUS      4
7788KT197RUS      4
92928M178RUS      4
Y7129Y50RUS       3
X758HY197RUS      3
...             ...
Y967O8197RUS      1
Y965O8197RUS      1
Y965EE197RUS      1
Y964O8197RUS      1
Y964EE197RUS      1

[531 rows x 1 columns]

  * select from the initial dataframe all the rows corresponding to the top-1 car
  number, we want to zoom in a little bit

In [14]:
top_1_car_number = "Y163O8161RUS"
df[df.index == top_1_car_number]

              Refund   Fines  Make  Model
CarNumber
Y163O8161RUS       2  3200.0  Ford  Focus
Y163O8161RUS       2  1600.0  Ford  Focus

  * display the car numbers grouped by the sum of the fines in descending order,
  we want to find those who paid the most

In [15]:
fines_sum_df = group_by_car_number.agg({"Fines": "sum"})
fines_sum_df.sort_values(by="Fines", ascending=False, inplace=True)
display(fines_sum_df)

                 Fines
CarNumber
X758HY197RUS  242000.0
9020YC197RUS  217500.0
M0279X197RUS  216000.0
Y352O8197RUS  207200.0
Y778EE197RUS  192000.0
...                ...
Y166O8161RUS     100.0
K326T8197RUS     100.0
Y195O8161RUS     100.0
C58078163RUS     100.0
705787163RUS     100.0

[531 rows x 1 columns]

  * display a table that answers the question: are there any car numbers that were connected to different models?

In [16]:
car_model_check = (
    group_by_car_number["Model"].nunique().reset_index(name="UniqueModels")
)
# cars_with_multiple_models = car_model_check[car_model_check['UniqueModels'] > 1]
# display(cars_with_multiple_models)
display(car_model_check.sort_values("UniqueModels", ascending=False))

        CarNumber  UniqueModels
530  Y973O8197RUS             1
0    704687163RUS             1
1    704787163RUS             1
514  Y7699C197RUS             1
513  Y7689C197RUS             1
..            ...           ...
321  M5039X197RUS             0
259  H837YK197RUS             0
141  96907X197RUS             0
504  Y687HM197RUS             0
505  Y693HM197RUS             0

[531 rows x 2 columns]

There are no car numbers that were connected to diffrenet models because there are no UniqueModels values more than 1